#include "team_5.h"

int loading()
{
	int a;

	printf("\n\n\n\n");
	printf("		        _                 _ _             \n");
	printf("		       \| \|               \| (_)            \n");
	printf("		       \| \| ___   __ _  __\| \|_ _ __   __ _ \n");
	printf("		       \| \|\/ _ \\ \/ _` \|\/ _` \| \| '_ \\ \/ _` \|\n");
	printf("		       \| \| (_) \| (_\| \| (_\| \| \| \| \| \| (_\| \|\n");
	printf("	  	       \|_\|\\___\/ \\__,_\|\\__,_\|_\|_\| \|_\|\\__, \|\n");
	printf("			 	                     __/ \|\n");
	printf("			                            \|___\/ \n\n");
	printf("		--------------------------------------------------\n\n");
	printf("		--------------------------------------------------");
	gotoxy(5, 21);
	printf("| 202211249 °­À±¿ø |\n");
	gotoxy(5, 22);
	printf("| 202211255 ±Ç±¸Çö |");
	gotoxy(5, 23);
	printf("| 202211314 ½ÅÇö¼­ |");
	gotoxy(5, 24);
	printf("| 202211402 È«½ÂÁÖ |");
	gotoxy(0, 14);
	printf("		");
	for (a = 1; a <= 25; a++)
	{
		printf("¡á");
		Sleep(100);
	}
	printf("\n\n");
	system("cls");
}